package hello;

public class HelloJava {

	public static void main(String[] args) {
		
		System.out.println("Hello, Java");
		
		/*
		 * Hot Key
		 * 1. Ctrl + N : Package 또는 Class 생성시 사용
		 * 2. Ctrl + S : 현재 작성한 파일 저장
		 * 3. Ctrl + F11 : 작성한 코드 실행
		 * # Project -> Build Automatically : 코드 작성시 자동 빌드 기능
		 * 
		 * 컴퓨터 자료 표현 방법 (이진수)
		 * 1. 비트(bit) : 컴퓨터에서 자료를 표현하는 최소 단위 0 또는 1
		 * 2. 바이트(byte) : 8 bit
		 * 3. 이진수 : 컴퓨터 에서 표현되는 자려의 형태
		 * 			0000 1010 (이진수) => 10 (십진수)
		 * 4. 8진수 : 이진수를 3비트씩 모아서 표현
		 * 5. 16진수 : 이진수를 4비트씩 모아서 표현
		 *
		 * 컴퓨터에서 음수 표현하기
		 * 1. 2의 보수로 표현
		 * 2. 양수와 음수는 더해서 0 이 되어야 함
		 * 		0000 0101 (5)
		 * 		1111 1010 (1의 보수)
		 * 		1111 1011 (5에 대한 2의 보수)
		 * # 보수 : 보충해 주는 수
		 * # 부호 비트(비트의 맨 앞자리 수로, 0이면 양수, 1이면 음수이다.)
		 * # 음수(2의 보수) 표현 방법 : 0은 1로, 1은 0으로 변경 -> 1을 더한다.
		 * 
		 * */
	}

}
